Tekla Open API Reference for Tekla Structures 2025
OBB.Intersects Method (OBB)
 Tests if current OBB intersects with the given OBB
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool Intersects(
	OBB obb
)
Public Function Intersects (
	obb As OBB
) As Boolean
Parameters
obb
Type: Tekla.Structures.Geometry3d.OBB
OBB to test against
Return Value
Type: Boolean
True if the OBBs intersect, otherwise false
Exceptions
Exception | Condition
ArgumentNullException | Thrown when null is assigned to the obb parameter.
See Also
Reference
OBB Class
Intersects Overload
Tekla.Structures.Geometry3d Namespace